[Survived] ObjectLiteral
components/common/card/login-card.vue:38:16
 <script>
 import { mapGetters, mapActions } from 'vuex'
 
-export default {
-  computed: {
-    ...mapGetters('auth', [
-      'username', 'password',
-      'usernameIsValid', 'passwordIsValid',
-      'userNameErrorShown', 'passwordErrorShown',
-      'usernameErrorKey', 'passwordErrorKey',
-      'isLoading', 'isDisabled'
-    ])
-  },
-  methods: {
-    ...mapActions('auth',[
-      'init',
-      'updateUsername', 'blurUsername',
-      'updatePassword', 'blurPassword',
-      'login'
-    ])
-  },
-  created() {
-    this.init()
-  }
-}
+export default {}
 </script>
 

[Survived] StringLiteral
components/common/card/login-card.vue:40:19
 
 export default {
   computed: {
-    ...mapGetters('auth', [
+    ...mapGetters("", [
       'username', 'password',
       'usernameIsValid', 'passwordIsValid',

[Survived] StringLiteral
components/common/card/login-card.vue:42:7
   computed: {
     ...mapGetters('auth', [
       'username', 'password',
-      'usernameIsValid', 'passwordIsValid',
+      "", 'passwordIsValid',
       'userNameErrorShown', 'passwordErrorShown',
       'usernameErrorKey', 'passwordErrorKey',

[Survived] StringLiteral
components/common/card/login-card.vue:45:20
       'usernameIsValid', 'passwordIsValid',
       'userNameErrorShown', 'passwordErrorShown',
       'usernameErrorKey', 'passwordErrorKey',
-      'isLoading', 'isDisabled'
+      'isLoading', ""
     ])
   },

[Survived] StringLiteral
components/common/card/login-card.vue:52:7
     ...mapActions('auth',[
       'init',
       'updateUsername', 'blurUsername',
-      'updatePassword', 'blurPassword',
+      "", 'blurPassword',
       'login'
     ])

[Survived] Block
components/common/card/login-card.vue:56:13
       'login'
     ])
   },
-  created() {
-    this.init()
-  }
+  created() {}
 }
 </script>
