[Survived] Block
src/api/domains/domain.js:4:17
 import axios from 'axios'
 
 export default class DomainAPI {
-  constructor() {
-    this.http = axios.create({
-      baseURL: 'https://jsonplaceholder.typicode.com'
-    })
-  }
+  constructor() {}
 
   login({ username, password }) {

[Killed] Block
src/api/domains/domain.js:10:33
     })
   }
 
-  login({ username, password }) {
-    return this.http.post("/posts", { title: username, text: password })
-  }
+  login({ username, password }) {}
 }
 
