[Survived] BooleanSubstitution
src/api/domains/index.js:1:36
-const files = require.context('.', false, /\.js$/)
+const files = require.context('.', true, /\.js$/)
 
 const domains = {}

[Survived] IfStatement
src/api/domains/index.js:6:7
 const domains = {}
 
 files.keys().forEach(key => {
-  if (key === './index.js') return
+  if (false) return
   domains[key.replace(/(\.\/|\.js)/g, '')] = new (files(key).default)()
 })

[Timeout] IfStatement
src/api/domains/index.js:6:7
 const domains = {}
 
 files.keys().forEach(key => {
-  if (key === './index.js') return
+  if (true) return
   domains[key.replace(/(\.\/|\.js)/g, '')] = new (files(key).default)()
 })
