[Survived] Block
src/store/modules/auth.js:6:21
 
 const namespaced = true
 
-const state = () => { return {
-    input: {
-      username: "",
-      password: ""
-    },
-    validation: {
-      username: validations.username,
-      password: validations.password
-    },
-    usernameWasEdited: false,
-    passwordWasEdited: false,
-    isLoading: false
-  }
-}
+const state = () => {}
 
 const mutations = {

[Killed] ObjectLiteral
src/store/modules/auth.js:7:12
 const namespaced = true
 
 const state = () => { return {
-    input: {
-      username: "",
-      password: ""
-    },
+    input: {},
     validation: {
       username: validations.username,

[Survived] StringLiteral
src/store/modules/auth.js:8:17
 
 const state = () => { return {
     input: {
-      username: "",
+      username: "Stryker was here!",
       password: ""
     },

[Survived] BooleanSubstitution
src/store/modules/auth.js:15:24
       username: validations.username,
       password: validations.password
     },
-    usernameWasEdited: false,
+    usernameWasEdited: true,
     passwordWasEdited: false,
     isLoading: false

[Survived] BooleanSubstitution
src/store/modules/auth.js:16:24
       password: validations.password
     },
     usernameWasEdited: false,
-    passwordWasEdited: false,
+    passwordWasEdited: true,
     isLoading: false
   }

[Survived] BooleanSubstitution
src/store/modules/auth.js:17:16
     },
     usernameWasEdited: false,
     passwordWasEdited: false,
-    isLoading: false
+    isLoading: true
   }
 }

[Survived] Block
src/store/modules/auth.js:22:16
 }
 
 const mutations = {
-  INIT (state) {
-    state.input.username = ""
-    state.input.password = ""
-    state.usernameWasEdited = false
-    state.passwordWasEdited = false
-    state.isLoading = false
-  },
+  INIT (state) {},
 
   UPDATE_LOGIN_USERNAME (state, username) {

[Killed] BooleanSubstitution
src/store/modules/auth.js:25:31
   INIT (state) {
     state.input.username = ""
     state.input.password = ""
-    state.usernameWasEdited = false
+    state.usernameWasEdited = true
     state.passwordWasEdited = false
     state.isLoading = false

[Survived] BooleanSubstitution
src/store/modules/auth.js:26:31
     state.input.username = ""
     state.input.password = ""
     state.usernameWasEdited = false
-    state.passwordWasEdited = false
+    state.passwordWasEdited = true
     state.isLoading = false
   },

[Killed] BooleanSubstitution
src/store/modules/auth.js:27:23
     state.input.password = ""
     state.usernameWasEdited = false
     state.passwordWasEdited = false
-    state.isLoading = false
+    state.isLoading = true
   },
 

[Killed] Block
src/store/modules/auth.js:30:43
     state.isLoading = false
   },
 
-  UPDATE_LOGIN_USERNAME (state, username) {
-    state.input.username = username
-  },
+  UPDATE_LOGIN_USERNAME (state, username) {},
 
   UPDATE_LOGIN_PASSWORD (state, password) {

[Killed] Block
src/store/modules/auth.js:34:43
     state.input.username = username
   },
 
-  UPDATE_LOGIN_PASSWORD (state, password) {
-    state.input.password = password
-  },
+  UPDATE_LOGIN_PASSWORD (state, password) {},
 
   BLUR_USERNAME (state) {

[Killed] Block
src/store/modules/auth.js:38:25
     state.input.password = password
   },
 
-  BLUR_USERNAME (state) {
-    state.usernameWasEdited = true
-  },
+  BLUR_USERNAME (state) {},
 
   BLUR_PASSWORD (state) {

[Killed] BooleanSubstitution
src/store/modules/auth.js:39:31
   },
 
   BLUR_USERNAME (state) {
-    state.usernameWasEdited = true
+    state.usernameWasEdited = false
   },
 

[Killed] Block
src/store/modules/auth.js:42:25
     state.usernameWasEdited = true
   },
 
-  BLUR_PASSWORD (state) {
-    state.passwordWasEdited = true
-  },
+  BLUR_PASSWORD (state) {},
 
   TOGGLE_LOADING (state, to) {

[Survived] BooleanSubstitution
src/store/modules/auth.js:43:31
   },
 
   BLUR_PASSWORD (state) {
-    state.passwordWasEdited = true
+    state.passwordWasEdited = false
   },
 

[Killed] Block
src/store/modules/auth.js:46:30
     state.passwordWasEdited = true
   },
 
-  TOGGLE_LOADING (state, to) {
-    state.isLoading = to
-  }
+  TOGGLE_LOADING (state, to) {}
 }
 

[Killed] ConditionalExpression
src/store/modules/auth.js:56:41
   password: state => state.input.password,
   usernameErrorKey: state => getError(state.input.username, state.validation.username),
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
-  hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
+  hasUsernameError: (state, getters) => true,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,

[Survived] ConditionalExpression
src/store/modules/auth.js:56:41
   password: state => state.input.password,
   usernameErrorKey: state => getError(state.input.username, state.validation.username),
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
-  hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
+  hasUsernameError: (state, getters) => false,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,

[Killed] ConditionalExpression
src/store/modules/auth.js:57:41
   usernameErrorKey: state => getError(state.input.username, state.validation.username),
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
-  hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
+  hasPasswordError: (state, getters) => true,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,

[Killed] ConditionalExpression
src/store/modules/auth.js:57:41
   usernameErrorKey: state => getError(state.input.username, state.validation.username),
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
-  hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
+  hasPasswordError: (state, getters) => false,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,

[Killed] ConditionalExpression
src/store/modules/auth.js:58:43
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
-  userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
+  userNameErrorShown: (state, getters) => true,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,

[Killed] ConditionalExpression
src/store/modules/auth.js:58:43
   passwordErrorKey: state => getError(state.input.password, state.validation.password),
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
-  userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
+  userNameErrorShown: (state, getters) => false,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,

[Killed] ConditionalExpression
src/store/modules/auth.js:59:43
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
-  passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
+  passwordErrorShown: (state, getters) => false,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
   isLoading: state => state.isLoading,

[Killed] BinaryExpression
src/store/modules/auth.js:59:43
   hasUsernameError: (state, getters) => getters.usernameErrorKey != null,
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
-  passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
+  passwordErrorShown: (state, getters) => state.passwordWasEdited || getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
   isLoading: state => state.isLoading,

[Killed] BinaryExpression
src/store/modules/auth.js:60:38
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
-  hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
+  hasInputError: (state, getters) => getters.hasUsernameError && getters.hasPasswordError,
   isLoading: state => state.isLoading,
   isDisabled: (state, getters) => getters.isLoading || getters.hasInputError

[Killed] ConditionalExpression
src/store/modules/auth.js:60:38
   hasPasswordError: (state, getters) => getters.passwordErrorKey != null,
   userNameErrorShown: (state, getters) => state.usernameWasEdited && getters.hasUsernameError,
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
-  hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
+  hasInputError: (state, getters) => false,
   isLoading: state => state.isLoading,
   isDisabled: (state, getters) => getters.isLoading || getters.hasInputError

[Killed] BinaryExpression
src/store/modules/auth.js:62:35
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
   isLoading: state => state.isLoading,
-  isDisabled: (state, getters) => getters.isLoading || getters.hasInputError
+  isDisabled: (state, getters) => getters.isLoading && getters.hasInputError
 }
 

[Killed] ConditionalExpression
src/store/modules/auth.js:62:35
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
   isLoading: state => state.isLoading,
-  isDisabled: (state, getters) => getters.isLoading || getters.hasInputError
+  isDisabled: (state, getters) => false
 }
 

[Survived] Block
src/store/modules/auth.js:66:20
 }
 
 const actions = {
-  init({ commit }) {
-    return commit('INIT')
-  },
+  init({ commit }) {},
 
   updateUsername({ commit }, value) {

[Killed] Block
src/store/modules/auth.js:70:37
     return commit('INIT')
   },
 
-  updateUsername({ commit }, value) {
-    return commit('UPDATE_LOGIN_USERNAME', value)
-  },
+  updateUsername({ commit }, value) {},
 
   blurUsername({ commit }) {

[Killed] Block
src/store/modules/auth.js:74:28
     return commit('UPDATE_LOGIN_USERNAME', value)
   },
 
-  blurUsername({ commit }) {
-    return commit('BLUR_USERNAME')
-  },
+  blurUsername({ commit }) {},
 
   updatePassword({ commit }, value) {

[Killed] Block
src/store/modules/auth.js:78:37
     return commit('BLUR_USERNAME')
   },
 
-  updatePassword({ commit }, value) {
-    return commit('UPDATE_LOGIN_PASSWORD', value)
-  },
+  updatePassword({ commit }, value) {},
 
   blurPassword({ commit }) {

[Killed] StringLiteral
src/store/modules/auth.js:79:19
   },
 
   updatePassword({ commit }, value) {
-    return commit('UPDATE_LOGIN_PASSWORD', value)
+    return commit("", value)
   },
 

[Killed] Block
src/store/modules/auth.js:82:28
     return commit('UPDATE_LOGIN_PASSWORD', value)
   },
 
-  blurPassword({ commit }) {
-    return commit('BLUR_PASSWORD')
-  },
+  blurPassword({ commit }) {},
 
   login (context) {

[Killed] Block
src/store/modules/auth.js:86:19
     return commit('BLUR_PASSWORD')
   },
 
-  login (context) {
-    context.commit('TOGGLE_LOADING', true)
-    return this.$api.domain
-      .login(context.state.input)
-        .then(response =>
-          handleLogin(this.$app, context, response))
-        .catch(connectionError =>
-          this.$app.$notify('error.login.connection'))
-        .finally(() =>
-          context.commit('TOGGLE_LOADING', false))
-  },
+  login (context) {},
 
   logout(context) {

[Killed] BooleanSubstitution
src/store/modules/auth.js:87:38
   },
 
   login (context) {
-    context.commit('TOGGLE_LOADING', true)
+    context.commit('TOGGLE_LOADING', false)
     return this.$api.domain
       .login(context.state.input)

[Killed] BooleanSubstitution
src/store/modules/auth.js:95:44
         .catch(connectionError =>
           this.$app.$notify('error.login.connection'))
         .finally(() =>
-          context.commit('TOGGLE_LOADING', false))
+          context.commit('TOGGLE_LOADING', true))
   },
 

[Killed] StringLiteral
src/store/modules/auth.js:95:26
         .catch(connectionError =>
           this.$app.$notify('error.login.connection'))
         .finally(() =>
-          context.commit('TOGGLE_LOADING', false))
+          context.commit("", false))
   },
 

[Killed] Block
src/store/modules/auth.js:98:19
           context.commit('TOGGLE_LOADING', false))
   },
 
-  logout(context) {
-    this.$app.$notify('note.logout')
-    this.$app.$router.push("/login")
-    return context.dispatch('user/set', null, { root: true })
-  }
+  logout(context) {}
 }
 

[Survived] BooleanSubstitution
src/store/modules/auth.js:101:55
   logout(context) {
     this.$app.$notify('note.logout')
     this.$app.$router.push("/login")
-    return context.dispatch('user/set', null, { root: true })
+    return context.dispatch('user/set', null, { root: false })
   }
 }

[Survived] Block
src/store/modules/auth.js:113:49
   actions
 }
 
-const handleLogin = (app, context, response) => {
-  if (response.status == 201)
-    handleLoginSuccess(app, context, response)
-  else
-    app.$notify('error.login.wrongCredentials')
-}
+const handleLogin = (app, context, response) => {}
 
 const handleLoginSuccess = (app, context, response) => {

[Killed] BinaryExpression
src/store/modules/auth.js:114:7
 }
 
 const handleLogin = (app, context, response) => {
-  if (response.status == 201)
+  if (response.status != 201)
     handleLoginSuccess(app, context, response)
   else

[Survived] IfStatement
src/store/modules/auth.js:114:7
 }
 
 const handleLogin = (app, context, response) => {
-  if (response.status == 201)
+  if (true)
     handleLoginSuccess(app, context, response)
   else

[Survived] StringLiteral
src/store/modules/auth.js:117:17
   if (response.status == 201)
     handleLoginSuccess(app, context, response)
   else
-    app.$notify('error.login.wrongCredentials')
+    app.$notify("")
 }
 

[Killed] Block
src/store/modules/auth.js:120:56
     app.$notify('error.login.wrongCredentials')
 }
 
-const handleLoginSuccess = (app, context, response) => {
-  context.dispatch('user/set', response.data.token, { root: true })
-  app.$notify('success.login')
-  app.$router.push('/')
-}
+const handleLoginSuccess = (app, context, response) => {}
 

[Killed] BooleanSubstitution
src/store/modules/auth.js:121:61
 }
 
 const handleLoginSuccess = (app, context, response) => {
-  context.dispatch('user/set', response.data.token, { root: true })
+  context.dispatch('user/set', response.data.token, { root: false })
   app.$notify('success.login')
   app.$router.push('/')

[Survived] StringLiteral
src/store/modules/auth.js:121:20
 }
 
 const handleLoginSuccess = (app, context, response) => {
-  context.dispatch('user/set', response.data.token, { root: true })
+  context.dispatch("", response.data.token, { root: true })
   app.$notify('success.login')
   app.$router.push('/')
