[Survived] BooleanSubstitution
src/api/mock/domain-mock.js:7:31
 export const applyDomainAdapter = (axios) => {
   const adapter = new MockAdapter(axios, { delayResponse: 2500 })
 
-  mockLogin( on(adapter), use(true) )
+  mockLogin( on(adapter), use(false) )
 }
 

[Survived] Block
src/api/mock/domain-mock.js:10:37
   mockLogin( on(adapter), use(true) )
 }
 
-const mockLogin = (adapter, use) => {
-  let call = adapter.onPost('/posts')
-  let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
-  if (!use) { call.passThrough() } else {
-    call.reply(201, { token })
-  }
-}
+const mockLogin = (adapter, use) => {}
 
 const on = adapter => adapter

[Survived] StringLiteral
src/api/mock/domain-mock.js:11:29
 }
 
 const mockLogin = (adapter, use) => {
-  let call = adapter.onPost('/posts')
+  let call = adapter.onPost("")
   let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
   if (!use) { call.passThrough() } else {

[Survived] StringLiteral
src/api/mock/domain-mock.js:12:50
 
 const mockLogin = (adapter, use) => {
   let call = adapter.onPost('/posts')
-  let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
+  let token = jwt.sign({ username: "bela", role: "", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
   if (!use) { call.passThrough() } else {
     call.reply(201, { token })

[Survived] ArrayLiteral
src/api/mock/domain-mock.js:12:72
 
 const mockLogin = (adapter, use) => {
   let call = adapter.onPost('/posts')
-  let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
+  let token = jwt.sign({ username: "bela", role: "admin", permissions: [] }, "secret-key");
   if (!use) { call.passThrough() } else {
     call.reply(201, { token })

[Survived] IfStatement
src/api/mock/domain-mock.js:13:7
 const mockLogin = (adapter, use) => {
   let call = adapter.onPost('/posts')
   let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
-  if (!use) { call.passThrough() } else {
+  if (true) { call.passThrough() } else {
     call.reply(201, { token })
   }

[Survived] IfStatement
src/api/mock/domain-mock.js:13:7
 const mockLogin = (adapter, use) => {
   let call = adapter.onPost('/posts')
   let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
-  if (!use) { call.passThrough() } else {
+  if (false) { call.passThrough() } else {
     call.reply(201, { token })
   }
