[Killed] Block
vue-boilerplate/src/util/jwt.js:1:33
-export const parse = (token) => {
-  try {
-    return JSON.parse(atob(token.split('.')[1]));
-  } catch (e) {
-    return null;
-  }
-};
+export const parse = (token) => {};
 

[Killed] Block
vue-boilerplate/src/util/jwt.js:2:7
 export const parse = (token) => {
-  try {
-    return JSON.parse(atob(token.split('.')[1]));
-  } catch (e) {
+  try {} catch (e) {
     return null;
   }

[Killed] StringLiteral
vue-boilerplate/src/util/jwt.js:3:40
 export const parse = (token) => {
   try {
-    return JSON.parse(atob(token.split('.')[1]));
+    return JSON.parse(atob(token.split("")[1]));
   } catch (e) {
     return null;

[Killed] Block
vue-boilerplate/src/util/jwt.js:4:15
 export const parse = (token) => {
   try {
     return JSON.parse(atob(token.split('.')[1]));
-  } catch (e) {
-    return null;
-  }
+  } catch (e) {}
 };
 
