[Survived] ConditionalExpression
src/store/modules/auth.js:62:35
   passwordErrorShown: (state, getters) => state.passwordWasEdited && getters.hasPasswordError,
   hasInputError: (state, getters) => getters.hasUsernameError || getters.hasPasswordError,
   isLoading: state => state.isLoading,
-  isDisabled: (state, getters) => getters.isLoading || getters.hasInputError
+  isDisabled: (state, getters) => true
 }
 

[Survived] Block
src/store/modules/auth.js:113:49
   actions
 }
 
-const handleLogin = (app, context, response) => {
-  if (response.status == 200)
-    handleLoginSuccess(app, context, response)
-  else
-    app.$notify('error.login.wrongCredentials')
-}
+const handleLogin = (app, context, response) => {}
 
 const handleLoginSuccess = (app, context, response) => {

[Killed] BinaryExpression
src/store/modules/auth.js:114:7
 }
 
 const handleLogin = (app, context, response) => {
-  if (response.status == 200)
+  if (response.status != 200)
     handleLoginSuccess(app, context, response)
   else

[Killed] IfStatement
src/store/modules/auth.js:114:7
 }
 
 const handleLogin = (app, context, response) => {
-  if (response.status == 200)
+  if (false)
     handleLoginSuccess(app, context, response)
   else
