[Survived] Block
src/api/mock/index.js:4:23
 import domains from '../domains'
 import { applyDomainAdapter } from './domain-mock'
 
-export default (() => {
-
-  applyDomainAdapter(domains["domain"].http)
-
-})()
+export default (() => {})()
 
