[Survived] Block
src/components/common/navbar-bottom.vue:11:10
 
 <script>
 export default {
-  data() {
-     return {
-       selected: 'en',
-       options: [
-         { value: 'hu', text: 'Magyar' },
-         { value: 'en', text: 'English' }
-       ]
-     }
-   },
+  data() {},
    watch: {
      selected(value) {

[Survived] ObjectLiteral
src/components/common/navbar-bottom.vue:12:13
 <script>
 export default {
   data() {
-     return {
-       selected: 'en',
-       options: [
-         { value: 'hu', text: 'Magyar' },
-         { value: 'en', text: 'English' }
-       ]
-     }
+     return {}
    },
    watch: {

[Survived] ArrayLiteral
src/components/common/navbar-bottom.vue:14:17
   data() {
      return {
        selected: 'en',
-       options: [
-         { value: 'hu', text: 'Magyar' },
-         { value: 'en', text: 'English' }
-       ]
+       options: []
      }
    },

[Survived] ObjectLiteral
src/components/common/navbar-bottom.vue:16:10
        selected: 'en',
        options: [
          { value: 'hu', text: 'Magyar' },
-         { value: 'en', text: 'English' }
+         {}
        ]
      }

[Survived] Block
src/components/common/navbar-bottom.vue:21:22
      }
    },
    watch: {
-     selected(value) {
-       this.$i18n.locale = value
-     }
+     selected(value) {}
    }
 }
