[Survived] ObjectLiteral
src/components/common/navbar-top.vue:18:16
 <script>
 import { mapGetters, mapActions } from 'vuex'
 
-export default {
-  computed: {
-    ...mapGetters('user', [
-      "isLoggedIn"
-    ])
-  },
-  methods: {
-    ...mapActions('auth', [
-      'logout'
-    ])
-  }
-}
+export default {}
 </script>
 

[Survived] ArrayLiteral
src/components/common/navbar-top.vue:20:27
 
 export default {
   computed: {
-    ...mapGetters('user', [
-      "isLoggedIn"
-    ])
+    ...mapGetters('user', [])
   },
   methods: {

[Survived] ObjectLiteral
src/components/common/navbar-top.vue:24:12
       "isLoggedIn"
     ])
   },
-  methods: {
-    ...mapActions('auth', [
-      'logout'
-    ])
-  }
+  methods: {}
 }
 </script>
