[Survived] Block
components/common/notifications/custom-notification.vue:15:14
 export default {
   props: [ 'props' ],
   methods: {
-    is(type) {
-      return this.props.item.text.split('.')[0] == type
-    },
+    is(type) {},
     isNeither() {
       return !this.is('success') && !this.is('error')

[Survived] ConditionalExpression
components/common/notifications/custom-notification.vue:16:14
   props: [ 'props' ],
   methods: {
     is(type) {
-      return this.props.item.text.split('.')[0] == type
+      return false
     },
     isNeither() {

[Survived] BinaryExpression
components/common/notifications/custom-notification.vue:16:14
   props: [ 'props' ],
   methods: {
     is(type) {
-      return this.props.item.text.split('.')[0] == type
+      return this.props.item.text.split('.')[0] != type
     },
     isNeither() {

[Survived] Block
components/common/notifications/custom-notification.vue:18:17
     is(type) {
       return this.props.item.text.split('.')[0] == type
     },
-    isNeither() {
-      return !this.is('success') && !this.is('error')
-    }
+    isNeither() {}
   },
   computed: {

[Survived] PrefixUnaryExpression
components/common/notifications/custom-notification.vue:19:14
       return this.props.item.text.split('.')[0] == type
     },
     isNeither() {
-      return !this.is('success') && !this.is('error')
+      return this.is('success') && !this.is('error')
     }
   },

[Survived] ConditionalExpression
components/common/notifications/custom-notification.vue:19:14
       return this.props.item.text.split('.')[0] == type
     },
     isNeither() {
-      return !this.is('success') && !this.is('error')
+      return false
     }
   },

[Survived] ObjectLiteral
components/common/notifications/custom-notification.vue:22:13
       return !this.is('success') && !this.is('error')
     }
   },
-  computed: {
-    compClass() {
-      let type =  this.props.item.type
-      return {
-        'card': true,
-        'm-2': true,
-        'w-shadow': true,
-        'text-white': true,
-        'bg-success': this.is("success"),
-        'bg-danger': this.is("error"),
-        'bg-secondary': this.isNeither()
-      }
-    }
-  }
+  computed: {}
 }
 </script>

[Survived] Block
components/common/notifications/custom-notification.vue:23:17
     }
   },
   computed: {
-    compClass() {
-      let type =  this.props.item.type
-      return {
-        'card': true,
-        'm-2': true,
-        'w-shadow': true,
-        'text-white': true,
-        'bg-success': this.is("success"),
-        'bg-danger': this.is("error"),
-        'bg-secondary': this.isNeither()
-      }
-    }
+    compClass() {}
   }
 }

[Survived] BooleanSubstitution
components/common/notifications/custom-notification.vue:26:17
     compClass() {
       let type =  this.props.item.type
       return {
-        'card': true,
+        'card': false,
         'm-2': true,
         'w-shadow': true,

[Survived] BooleanSubstitution
components/common/notifications/custom-notification.vue:27:16
       let type =  this.props.item.type
       return {
         'card': true,
-        'm-2': true,
+        'm-2': false,
         'w-shadow': true,
         'text-white': true,

[Survived] BooleanSubstitution
components/common/notifications/custom-notification.vue:28:21
       return {
         'card': true,
         'm-2': true,
-        'w-shadow': true,
+        'w-shadow': false,
         'text-white': true,
         'bg-success': this.is("success"),

[Survived] StringLiteral
components/common/notifications/custom-notification.vue:28:9
       return {
         'card': true,
         'm-2': true,
-        'w-shadow': true,
+        "": true,
         'text-white': true,
         'bg-success': this.is("success"),

[Survived] BooleanSubstitution
components/common/notifications/custom-notification.vue:29:23
         'card': true,
         'm-2': true,
         'w-shadow': true,
-        'text-white': true,
+        'text-white': false,
         'bg-success': this.is("success"),
         'bg-danger': this.is("error"),

[Survived] StringLiteral
components/common/notifications/custom-notification.vue:29:9
         'card': true,
         'm-2': true,
         'w-shadow': true,
-        'text-white': true,
+        "": true,
         'bg-success': this.is("success"),
         'bg-danger': this.is("error"),

[Survived] StringLiteral
components/common/notifications/custom-notification.vue:30:31
         'm-2': true,
         'w-shadow': true,
         'text-white': true,
-        'bg-success': this.is("success"),
+        'bg-success': this.is(""),
         'bg-danger': this.is("error"),
         'bg-secondary': this.isNeither()
