[Survived] StringLiteral
components/common/text/input-error.vue:18:28
 
 <script>
 export default {
-  props: [ 'localization', 'condition' ]
+  props: [ 'localization', "" ]
 }
 </script>

[Survived] ArrayLiteral
components/common/text/input-error.vue:18:10
 
 <script>
 export default {
-  props: [ 'localization', 'condition' ]
+  props: []
 }
 </script>
