[Survived] Block
src/components/transition/grow-appear-elements.vue:17:32
 import Velocity from 'velocity-animate'
 export default {
   methods: {
-    beforeEnter: function (el) {
-      el.style.opacity = 0
-      el.style.height = 0
-    },
+    beforeEnter: function (el) {},
     enter: function (el, done) {
       var delay = el.dataset.index * 150

[Survived] Block
src/components/transition/grow-appear-elements.vue:21:32
       el.style.opacity = 0
       el.style.height = 0
     },
-    enter: function (el, done) {
-      var delay = el.dataset.index * 150
-      setTimeout(function () {
-        Velocity(
-          el,
-          { opacity: 1, height: '1.6em' },
-          { complete: done }
-        )
-      }, delay)
-    },
+    enter: function (el, done) {},
     leave: function (el, done) {
       var delay = el.dataset.index * 150

[Survived] BinaryExpression
src/components/transition/grow-appear-elements.vue:22:19
       el.style.height = 0
     },
     enter: function (el, done) {
-      var delay = el.dataset.index * 150
+      var delay = el.dataset.index / 150
       setTimeout(function () {
         Velocity(

[Survived] Block
src/components/transition/grow-appear-elements.vue:23:30
     },
     enter: function (el, done) {
       var delay = el.dataset.index * 150
-      setTimeout(function () {
-        Velocity(
-          el,
-          { opacity: 1, height: '1.6em' },
-          { complete: done }
-        )
-      }, delay)
+      setTimeout(function () {}, delay)
     },
     leave: function (el, done) {

[Survived] StringLiteral
src/components/transition/grow-appear-elements.vue:26:33
       setTimeout(function () {
         Velocity(
           el,
-          { opacity: 1, height: '1.6em' },
+          { opacity: 1, height: "" },
           { complete: done }
         )

[Survived] ObjectLiteral
src/components/transition/grow-appear-elements.vue:27:11
         Velocity(
           el,
           { opacity: 1, height: '1.6em' },
-          { complete: done }
+          {}
         )
       }, delay)

[Survived] Block
src/components/transition/grow-appear-elements.vue:31:32
         )
       }, delay)
     },
-    leave: function (el, done) {
-      var delay = el.dataset.index * 150
-      setTimeout(function () {
-        Velocity(
-          el,
-          { opacity: 0, height: 0 },
-          { complete: done }
-        )
-      }, delay)
-    }
+    leave: function (el, done) {}
   }
 }

[Survived] BinaryExpression
src/components/transition/grow-appear-elements.vue:32:19
       }, delay)
     },
     leave: function (el, done) {
-      var delay = el.dataset.index * 150
+      var delay = el.dataset.index / 150
       setTimeout(function () {
         Velocity(

[Survived] Block
src/components/transition/grow-appear-elements.vue:33:30
     },
     leave: function (el, done) {
       var delay = el.dataset.index * 150
-      setTimeout(function () {
-        Velocity(
-          el,
-          { opacity: 0, height: 0 },
-          { complete: done }
-        )
-      }, delay)
+      setTimeout(function () {}, delay)
     }
   }

[Survived] ObjectLiteral
src/components/transition/grow-appear-elements.vue:36:11
       setTimeout(function () {
         Velocity(
           el,
-          { opacity: 0, height: 0 },
+          {},
           { complete: done }
         )

[Survived] ObjectLiteral
src/components/transition/grow-appear-elements.vue:37:11
         Velocity(
           el,
           { opacity: 0, height: 0 },
-          { complete: done }
+          {}
         )
       }, delay)
