[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:20:40
 
 // Components
 Vue.component('navbar-top', require('@/components/common/navbar-top').default)
-Vue.component('navbar-bottom', require('@/components/common/navbar-bottom').default)
+Vue.component('navbar-bottom', require("").default)
 
 Vue.component('grow-appear', require('@/components/transition/grow-appear').default)

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:25:37
 Vue.component('grow-appear', require('@/components/transition/grow-appear').default)
 Vue.component('grow-appear-elements', require('@/components/transition/grow-appear-elements').default)
 Vue.component('fade-appear-swap', require('@/components/transition/fade-appear-swap').default)
-Vue.component('slide-swap', require('@/components/transition/slide-swap').default)
+Vue.component('slide-swap', require("").default)
 
 Vue.component('login-card', require('@/components/common/card/login-card').default)

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:27:37
 Vue.component('fade-appear-swap', require('@/components/transition/fade-appear-swap').default)
 Vue.component('slide-swap', require('@/components/transition/slide-swap').default)
 
-Vue.component('login-card', require('@/components/common/card/login-card').default)
+Vue.component('login-card', require("").default)
 Vue.component('input-error', require('@/components/common/text/input-error').default)
 Vue.component('landing-message', require('@/components/common/text/landing-message').default)

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:27:15
 Vue.component('fade-appear-swap', require('@/components/transition/fade-appear-swap').default)
 Vue.component('slide-swap', require('@/components/transition/slide-swap').default)
 
-Vue.component('login-card', require('@/components/common/card/login-card').default)
+Vue.component("", require('@/components/common/card/login-card').default)
 Vue.component('input-error', require('@/components/common/text/input-error').default)
 Vue.component('landing-message', require('@/components/common/text/landing-message').default)

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:31:15
 Vue.component('input-error', require('@/components/common/text/input-error').default)
 Vue.component('landing-message', require('@/components/common/text/landing-message').default)
 
-Vue.component('custom-notification', require('@/components/common/notifications/custom-notification').default)
+Vue.component("", require('@/components/common/notifications/custom-notification').default)
 
 Vue.component('v-icon', Icon)

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:39:17
 const i18n = new VueI18n({
   locale: 'en',
   messages: {
-    en: require('../static/dictionary/eng.json'),
+    en: require(""),
     hu: require('../static/dictionary/hun.json')
   }

[Survived] BooleanSubstitution
jslibs/vue-boilerplate/src/main.js:45:28
 })
 
 // Dev config
-Vue.config.productionTip = false
+Vue.config.productionTip = true
 Vue.config.devtools = process.env.NODE_ENV === 'development'
 

[Survived] ConditionalExpression
jslibs/vue-boilerplate/src/main.js:46:23
 
 // Dev config
 Vue.config.productionTip = false
-Vue.config.devtools = process.env.NODE_ENV === 'development'
+Vue.config.devtools = false
 
 // Init

[Survived] BinaryExpression
jslibs/vue-boilerplate/src/main.js:46:23
 
 // Dev config
 Vue.config.productionTip = false
-Vue.config.devtools = process.env.NODE_ENV === 'development'
+Vue.config.devtools = process.env.NODE_ENV !== 'development'
 
 // Init

[Survived] ObjectLiteral
jslibs/vue-boilerplate/src/main.js:51:15
 // Init
 import App from './App'
 const app = new Vue({
-  components: { App },
+  components: {},
   router,
   store,

[Survived] StringLiteral
jslibs/vue-boilerplate/src/main.js:56:11
   store,
   i18n,
   template: '<App/>'
-}).$mount('#app-container')
+}).$mount("")
 
 store.$app = app
