[Survived] Block
src/router/guards/attemptAuthenticate.js:3:56
 import store from '../../store'
 
-export const attemptAuthenticate = (to, from, next) => {
-  if (store.state.user.isLoggedIn)
-    next()
-  else
-    next("/login")
-}
+export const attemptAuthenticate = (to, from, next) => {}
 

[Survived] IfStatement
src/router/guards/attemptAuthenticate.js:4:7
 import store from '../../store'
 
 export const attemptAuthenticate = (to, from, next) => {
-  if (store.state.user.isLoggedIn)
+  if (true)
     next()
   else

[Survived] IfStatement
src/router/guards/attemptAuthenticate.js:4:7
 import store from '../../store'
 
 export const attemptAuthenticate = (to, from, next) => {
-  if (store.state.user.isLoggedIn)
+  if (false)
     next()
   else
