[Survived] Block
src/router/guards/attemptAuthorize.js:4:63
 import store from '../../store'
 import { attemptAuthenticate } from './attemptAuthenticate'
 
-export const attemptAuthorize = (cred) => (to, from, next) => {
-  authenticate(to, from, next)
-  if (store.state.user.role == cred || store.state.user.permissions.includes(cred))
-    next()
-  else
-    next("/login")
-}
+export const attemptAuthorize = (cred) => (to, from, next) => {}
 

[Survived] IfStatement
src/router/guards/attemptAuthorize.js:6:7
 
 export const attemptAuthorize = (cred) => (to, from, next) => {
   authenticate(to, from, next)
-  if (store.state.user.role == cred || store.state.user.permissions.includes(cred))
+  if (false)
     next()
   else

[Survived] ConditionalExpression
src/router/guards/attemptAuthorize.js:6:7
 
 export const attemptAuthorize = (cred) => (to, from, next) => {
   authenticate(to, from, next)
-  if (store.state.user.role == cred || store.state.user.permissions.includes(cred))
+  if (false || store.state.user.permissions.includes(cred))
     next()
   else
