[Survived] StringLiteral
src/router/routes/home.js:4:9
 import { attemptAuthenticate } from '../guards/attemptAuthenticate'
 
 export default {
-  path: '/',
+  path: "",
   name: 'home-page',
   component: require('@/components/home-page').default,

[Survived] StringLiteral
src/router/routes/home.js:5:9
 
 export default {
   path: '/',
-  name: 'home-page',
+  name: "",
   component: require('@/components/home-page').default,
   beforeEnter: attemptAuthenticate

[Survived] StringLiteral
src/router/routes/home.js:6:22
 export default {
   path: '/',
   name: 'home-page',
-  component: require('@/components/home-page').default,
+  component: require("").default,
   beforeEnter: attemptAuthenticate
 }
