[Survived] StringLiteral
src/router/routes/index.js:1:31
-const files = require.context('.', false, /\.js$/)
+const files = require.context("", false, /\.js$/)
 const routes = []
 

[Survived] Block
src/router/routes/index.js:4:29
 const files = require.context('.', false, /\.js$/)
 const routes = []
 
-files.keys().forEach(key => {
-  if (key === './index.js') return
-  routes.push(files(key).default)
-})
+files.keys().forEach(key => {})
 
 export default routes
