[Survived] ConditionalExpression
vue-boilerplate/src/store/index.js:10:11
 
 export default new Vuex.Store({
   modules,
-  strict: process.env.NODE_ENV !== 'production'
+  strict: true
 })
 

[Survived] BinaryExpression
vue-boilerplate/src/store/index.js:10:11
 
 export default new Vuex.Store({
   modules,
-  strict: process.env.NODE_ENV !== 'production'
+  strict: process.env.NODE_ENV === 'production'
 })
 
