[Killed] Block
src/store/modules/index.js:4:29
 const files = require.context('.', false, /\.js$/)
 const modules = {}
 
-files.keys().forEach(key => {
-  if (key === './index.js') return
-  modules[key.replace(/(\.\/|\.js)/g, '')] = files(key).default
-})
+files.keys().forEach(key => {})
 
 export default modules

[Killed] BinaryExpression
src/store/modules/index.js:5:7
 const modules = {}
 
 files.keys().forEach(key => {
-  if (key === './index.js') return
+  if (key !== './index.js') return
   modules[key.replace(/(\.\/|\.js)/g, '')] = files(key).default
 })

[Killed] StringLiteral
src/store/modules/index.js:6:39
 
 files.keys().forEach(key => {
   if (key === './index.js') return
-  modules[key.replace(/(\.\/|\.js)/g, '')] = files(key).default
+  modules[key.replace(/(\.\/|\.js)/g, "Stryker was here!")] = files(key).default
 })
 
