[Survived] BooleanSubstitution
src/store/modules/search.js:1:20
-const namespaced = true
+const namespaced = false
 
 const state = () => { return {

[Killed] Block
src/store/modules/search.js:3:21
 const namespaced = true
 
-const state = () => { return {
-    filterParam: ""
-  }
-}
+const state = () => {}
 
 const mutations = {

[Killed] ObjectLiteral
src/store/modules/search.js:3:30
 const namespaced = true
 
-const state = () => { return {
-    filterParam: ""
-  }
+const state = () => { return {}
 }
 

[Killed] StringLiteral
src/store/modules/search.js:4:18
 const namespaced = true
 
 const state = () => { return {
-    filterParam: ""
+    filterParam: "Stryker was here!"
   }
 }

[Survived] Block
src/store/modules/search.js:9:35
 }
 
 const mutations = {
-  SET_FILTER_PARAM (state, value) {
-    state.filterParam = value
-  }
+  SET_FILTER_PARAM (state, value) {}
 }
 

[Survived] Block
src/store/modules/search.js:19:26
 }
 
 const actions = {
-  filter(context, value) {
-    context.commit('SET_FILTER_PARAM', value)
-  }
+  filter(context, value) {}
 }
 

[Survived] StringLiteral
src/store/modules/search.js:20:20
 
 const actions = {
   filter(context, value) {
-    context.commit('SET_FILTER_PARAM', value)
+    context.commit("", value)
   }
 }

[Survived] ObjectLiteral
src/store/modules/search.js:24:16
   }
 }
 
-export default {
-  namespaced,
-  state,
-  getters,
-  mutations,
-  actions
-}
+export default {}
 
