[Killed] Block
src/store/modules/user.js:5:21
 
 const namespaced = true
 
-const state = () => { return {
-    username: null,
-    isLoggedIn: false,
-    role: null,
-    permissions: []
-  }
-}
+const state = () => {}
 
 const mutations = {

[Survived] BooleanSubstitution
src/store/modules/user.js:7:17
 
 const state = () => { return {
     username: null,
-    isLoggedIn: false,
+    isLoggedIn: true,
     role: null,
     permissions: []

[Killed] Block
src/store/modules/user.js:14:21
 }
 
 const mutations = {
-  SET (state, user) {
-    state.isLoggedIn = true
-    state.username = user.username
-    state.role = user.role
-    state.permissions = user.permissions
-  },
+  SET (state, user) {},
 
   DEL (state) {

[Killed] BooleanSubstitution
src/store/modules/user.js:15:24
 
 const mutations = {
   SET (state, user) {
-    state.isLoggedIn = true
+    state.isLoggedIn = false
     state.username = user.username
     state.role = user.role

[Survived] Block
src/store/modules/user.js:21:15
     state.permissions = user.permissions
   },
 
-  DEL (state) {
-    state.username = null
-    state.isLoggedIn = false
-    state.role = null
-    state.permissions = []
-  }
+  DEL (state) {}
 }
 

[Killed] BooleanSubstitution
src/store/modules/user.js:23:24
 
   DEL (state) {
     state.username = null
-    state.isLoggedIn = false
+    state.isLoggedIn = true
     state.role = null
     state.permissions = []

[Killed] BinaryExpression
src/store/modules/user.js:32:28
 const getters = {
   username: state => state.username,
   isLoggedIn: state => state.isLoggedIn,
-  is: (state) => (role) => state.role == role,
+  is: (state) => (role) => state.role != role,
   can: (state) => (permission) => state.permissions.includes(permission)
 }

[Killed] ConditionalExpression
src/store/modules/user.js:32:28
 const getters = {
   username: state => state.username,
   isLoggedIn: state => state.isLoggedIn,
-  is: (state) => (role) => state.role == role,
+  is: (state) => (role) => true,
   can: (state) => (permission) => state.permissions.includes(permission)
 }

[Killed] Block
src/store/modules/user.js:37:25
 }
 
 const actions = {
-  set ({ commit }, jwt) {
-    let user = parse(jwt)
-    if (user)
-      commit('SET', user)
-    else
-      commit('DEL')
-  }
+  set ({ commit }, jwt) {}
 }
 

[Killed] IfStatement
src/store/modules/user.js:39:9
 const actions = {
   set ({ commit }, jwt) {
     let user = parse(jwt)
-    if (user)
+    if (false)
       commit('SET', user)
     else

[Killed] IfStatement
src/store/modules/user.js:39:9
 const actions = {
   set ({ commit }, jwt) {
     let user = parse(jwt)
-    if (user)
+    if (true)
       commit('SET', user)
     else
