[Killed] Block
vue-boilerplate/src/util/validate.js:1:48
-export const getError = (text, validations) => {
-  for (let validation of validations) {
-    if (!RegExp(validation.regex).test(text))
-      return validation.errorKey
-  }
-  return null
-}
+export const getError = (text, validations) => {}
 

[Killed] Block
vue-boilerplate/src/util/validate.js:2:39
 export const getError = (text, validations) => {
-  for (let validation of validations) {
-    if (!RegExp(validation.regex).test(text))
-      return validation.errorKey
-  }
+  for (let validation of validations) {}
   return null
 }

[Killed] PrefixUnaryExpression
vue-boilerplate/src/util/validate.js:3:9
 export const getError = (text, validations) => {
   for (let validation of validations) {
-    if (!RegExp(validation.regex).test(text))
+    if (RegExp(validation.regex).test(text))
       return validation.errorKey
   }

[Killed] IfStatement
vue-boilerplate/src/util/validate.js:3:9
 export const getError = (text, validations) => {
   for (let validation of validations) {
-    if (!RegExp(validation.regex).test(text))
+    if (true)
       return validation.errorKey
   }
