[Survived] Block
src/api/domains/index.js:5:29
 
 const domains = {}
 
-files.keys().forEach(key => {
-  if (key === './index.js') return
-  domains[key.replace(/(\.\/|\.js)/g, '')] = new (files(key).default)()
-})
+files.keys().forEach(key => {})
 
 export default domains
