[Survived] Block
src/api/mock/domain-mock.js:10:37
   mockLogin( on(adapter), use(true) )
 }
 
-const mockLogin = (adapter, use) => {
-  let call = adapter.onPost('/posts')
-  let token = jwt.sign({ username: "bela", role: "admin", permissions: ["doStuff", "doOtherStuff"] }, "secret-key");
-  if (!use) { call.passThrough() } else {
-    call.reply(200, { token })
-  }
-}
+const mockLogin = (adapter, use) => {}
 
 const on = adapter => adapter
